run/design0/stroke_0mm/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.844;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.844;
    }
    
    outlet
    {
        type            zeroGradient;
    }
    
    valve
    {
        type            kqRWallFunction;
        value           uniform 0.844;
    }
    
    walls
    {
        type            kqRWallFunction;
        value           uniform 0.844;
    }
}


// ************************************************************************* //
