run/design0/stroke_0mm/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

./Allmesh

#- Run serial
runApplication $(getApplication)

#- Run parallel
# runApplication decomposePar -force
# runParallel $(getApplication)
# runApplication reconstructPar -latestTime\
#     -fields '(p phi static(p) total(p) U)'

#- Post process
runApplication postProcess -latestTime\
    -funcs '(patchAverage(p,name=inlet) flowRatePatch(name=inlet))'

#------------------------------------------------------------------------------