run/design0/stroke_0mm/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

//These vertices define the block below. It envelopes the stl files. The block can be even bigger than the stl files
//Watch out if the stl files are created in mm or m!

vertices
(
	( -60 50 -160 )
	( 60 50 -160 )
	( 60 50 60 )
	( -60 50 60 )
	( -60 -50 -160 )
	( 60 -50 -160 )
	( 60 -50 60 )
	( -60 -50 60 )
);

blocks
( 
	hex (0 1 2 3 4 5 6 7) (24 44 20) simpleGrading (1 1 1) // scale 5:1 - 5 mm it's the side of the one cell ( original - 120 220 100 )
);

edges
(
);

boundary
(
    allBoundary
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (0 4 7 3)
            (2 6 5 1)
            (1 5 4 0)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //
